# Update Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel..::..Update Method
PathOfTravel Class See Also
---
Updates the path of travel by recalculating the path between the original start and end points.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public PathOfTravelCalculationStatus Update()
```

Visual Basic
---
```text
Public Function Update As PathOfTravelCalculationStatus
```

Visual C++
---
```text
public:
PathOfTravelCalculationStatus Update()
```

# ### Return Value
The status result of the recalculation.
# Remarks
If recalculation results in failure, Revit will post a warning.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This functionality is not available in Revit LT. |

# See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace